app/Controllers/Barang.php

  public function index()
  {
    $barang = $this->barangModel->findAll();
---
SELECT *
FROM `barang`