app/Controllers/Customer.php

  public function index()
  {
    $curentPage = $this->request->getVar('page_customer') ? $this->request->getVar('page_customer') : 1;

    $keyword = $this->request->getVar('keyword');
    if ($keyword) {
      $customer = $this->customerModel->search($keyword);
    } else {
      $customer = $this->customerModel;
    }


    $data = [
      "tittle" => "Customer",
      // 'customer' => $this->customerModel->findAll()
      'customer' => $customer->paginate(5, 'customer'),
---
SELECT *
FROM `customer`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `customer`

  public function update($id)
  {


    $slug = url_title($this->request->getVar('nama'), '-', true);
    $this->customerModel->save([
      'id_cust' => $id,
      'nama' => $this->request->getVar('nama'),
      'slug' => $slug,
      'alamat' => $this->request->getVar('alamat'),
      'nomor_telp' => $this->request->getVar('nomor_telp')
    ]);
---
UPDATE `customer` SET `nama` = 'Esan', `slug` = 'esan', `alamat` = 'Jl.Cikutra No.45, Bandung', `nomor_telp` = '087672881992', `updated_at` = '2023-04-09 00:08:01'
WHERE `customer`.`id_cust` IN ('11')