app/Controllers/Supplier.php

  public function index()
  {
    $supplier = $this->supplierModel->findAll();
---
SELECT *
FROM `supplier`

  public function save()
  {

    $slug = url_title($this->request->getVar('nama'), '-', true);
    $this->supplierModel->save([
      'nama' => $this->request->getVar('nama'),
      'slug' => $slug,
      'alamat' => $this->request->getVar('alamat'),
      'nomor_telp' => $this->request->getVar('nomor_telp'),

    ]);
---
INSERT INTO `supplier` (`nama`, `slug`, `alamat`, `nomor_telp`, `created_at`, `updated_at`) VALUES ('Zulfa', 'zulfa', 'Jl.Cigadung Timur No.21, Cikutra, Bandung', '083878772881', '2023-04-09 00:14:53', '2023-04-09 00:14:53')