app/Controllers/Transaksi.php

SELECT *
FROM `transaksi`
---
  public function index()
  {
    $transaksi = $this->transaksiModel->findAll();