app/Models/BarangModel.php

  public function getBarang($slug = false)
  {
    if ($slug == false) {
      return $this->findAll();
---
SELECT *
FROM `barang`