app/Models/CustomerModel.php

  public function getCustomer($slug = false)
  {
    if ($slug == false) {
      return $this->findAll();
    }

    return $this->where(['slug' => $slug])->first();
---
SELECT *
FROM `customer`
WHERE `slug` = 'jakgjak'
 LIMIT 1