app/Models/SupplierModel.php

SELECT *
FROM `supplier`
---
  public function getSupplier($slug = false)
  {
    if ($slug == false) {
      return $this->findAll();