app/Models/TransaksiModel.php

SELECT *
FROM `transaksi`
---
  public function getTransaksi($slug = false)
  {
    if ($slug == false) {
      return $this->findAll();